package Test1;

public class Car {
    // создала класс каров и надо создать карчики, сначала модификатор( по желанию
    // потом тип данных, а потом имя переменной
    private String brand;
    private int year;

    //создала переменные, теперь надо создать конструктор для них
    //конструктор - создается через объект, но мне надо создать его лично
    //создается он модификатором, далее имя как у класса,
    public Car(String brand, int year) {
        this.brand = brand;
        this.year = year;
    }
    // надо ещё создать метод, который будет возвращать что-то в терминал
    //метод создается с модификатором, статик, войд или что возвращает или не
    // возвращает
    public void print() {
        //возращаем систем аут, типа уже вывод
        System.out.println("Марка: " + brand + ".\nГод выпуска: " + year + ".");
    }
    //далее надо создать геттеры и сеттеры (в классе)
    // геттер - модификатор, далее тип данных у переменной(так понимаю?)
    //далее get(имя переменной) то есть что хотим посмотреть и в теле ретерн
    public String getBrand() {
        return brand;
    }
    public int getYear() {
        return year;
    }

    //теперь сеттеры, создаются с модификатором, также он ничего не возвращает
    //потому что просто сеттер дает ВОЗМОЖНОСТЬ изменить значение, а не получить
    //поэтому с void (
    // в геттере значение возвращается, а в сеттере нет, поэтому там с типом данных
    // а в сеттере типа нет, есть воид
    //пишется - модификатор, void, setПеременная(в скобрах тип и имя переменной)
    //Также в фигурных скобках указывается тело из переменной в классе и
    //переменной в конструкторе через this
    public void setBrand(String brand) {

        this.brand = brand;
    }
    public void setYear(int year){

        this.year = year;
    }
// и ещё - getПеременная и setПеременная - это новая переменная для вызова в main

}