package Test1;

public class Main {
    // создала класс
    // создаю метод мэйн для вывода
    public static void main(String[] args) {
        //тут мне надо отдать значения переменным конструктору
        // то есть надо создать объект по конструктору
        //объект создается сначала тип данных(это класс) потом имя переменной(объекта)
        //потом = new и опять тип данных(класс) и в скобках (значения полей)
        Car impala = new Car("Шевроле", 1967);

        // и теперь после создания объекта надо это всё вывести
        // Так понимаю что для выводу нужна переменная со значениями
        //и через точку переменная с выводом в классе Кар

        //надо вывести геттеры и сеттеры
        // вывод - это имя переменной, где УЖЕ хранятся значения (импала)
        //и через точку имя переменной, где выводится то, что мне надо в терминале

        impala.print();

        impala.setYear(2020);
        impala.print();
        //короче вывела и изменила с помощью сеттера значение, для этого надо
        //указать имя переменной, где уже лежат значения и через точку имя
        //переменной сеттера, в скобках - новое значение

    }



}